testcase/Capillary.MixRegime/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.02;

deltaT          1e-7;

adjustTimeStep  no;

maxCo		0.9;

writeControl    runTime;

writeInterval   0.5e-4;

// writeObjects (
//     U.medium    // Eulerian velocity field
//     kinematicCloud::positions // Lagrangian particle positions
// );

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;


timeFormat      general;

timePrecision   6;

runTimeModifiable yes;


// ************************************************************************* //
